# DataFrame 고급기술

In [6]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame # Pandas에는 Series 와 DataFrame이라는 두 종류의 모듈이 있습니다

In [7]:
# 정렬
# 인덱스를 정렬하는 방법
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
# Series의 기본 구조는 index와 그 index에 맵핑에 되는 values 값이 있습니다.
# Series(values 값 , index = index 값) // Series(values 값) 은 index가 기본적으로 0부터 시작됩니다.
# ex) 차례로 values 값이 2,4,6,8 이며 인덱스 값은 1,3,5,7이다.
#     exam = Series([2,4,6,8], index=[1,3,5,7])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [8]:
obj.sort_index() ## obj의 index를 osrt한 결과

a    1
b    2
c    3
d    0
dtype: int32

In [9]:
obj ## 위에서 sort를 해줬으나 obj의 결과는 변하지 않는다.

d    0
a    1
b    2
c    3
dtype: int32

In [10]:
obj = obj.sort_index()
obj

a    1
b    2
c    3
d    0
dtype: int32

### 실습 예제 1
series1, series2라는 Series 기본구조를 만든다. series1은 index는 ㄱ,ㄷ,ㄹ,ㄴ 순으로 하며, value 값은 index에 자음이 들어가는 단어로 자유롭게 정하시오. series2 에는 series1을 index 순으로 정렬된 Series를 넣으시고 series1, series2를 각각 출력하시오.

In [11]:
#obj = Series(range(4), index=['d', 'a', 'b', 'c'])
series1 = Series(['가', '다', '라', '나'], index = ['ㄱ', 'ㄷ', 'ㄹ', 'ㄴ'])
series1

ㄱ    가
ㄷ    다
ㄹ    라
ㄴ    나
dtype: object

In [12]:
series2 = series1.sort_index()
series2

ㄱ    가
ㄴ    나
ㄷ    다
ㄹ    라
dtype: object

In [52]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
## frame변수에 DataFrame이라는 구조를 넣고 있습니다.
## DataFrame(value값, index값(행), columns값(열))
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [14]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [15]:
frame.sort_index(axis=1)
# 열을 기준으로 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [34]:
# axis = 1 은 열을 기준으로 정렬
frame.sort_index(axis=1, ascending = False)
# 내림차순으로 정렬

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### 실습예제2
위 frame.sort_index(axis=? , ascending = ?) 에서 axis = (0 or 1), ascending = (False, True)를 자유롭게 넣어 보고 결과를 살펴본 뒤
frame2 = DataFrame(np.arange(9).reshape((3, 3)), index=['2', '3', '1'], columns=['3','1','2'])를 행과 열을 1,2,3 순으로 바꾼 뒤 출력해보시오.

In [53]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [55]:
frame.sort_index(axis=1, ascending = True) # = (axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [35]:
frame.sort_index(axis=0, ascending = False) #행 거꾸로 출력

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [36]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [31]:
frame.sort_index(axis=0, ascending = True)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [38]:
DataFrame(np.arange(9).reshape((3,3)), index = ['2','3','1'], columns=['3','1','2'])

   3  1  2
2  0  1  2
3  3  4  5
1  6  7  8

In [39]:
frame = DataFrame({'b': [4, 7, 3, 2], 'a': [4,9,2,5], 'c': [5,3,7,9]}) 
frame

   a  b  c
0  4  4  5
1  9  7  3
2  2  3  7
3  5  2  9

In [40]:
frame.sort_values(by='b')

   a  b  c
3  5  2  9
2  2  3  7
0  4  4  5
1  9  7  3

In [41]:
frame.sort_values(by='a')

   a  b  c
2  2  3  7
0  4  4  5
3  5  2  9
1  9  7  3

### 실습예제3
행 'c'를 기준으로 정렬한 Dataframe을 변수 frame2에 넣어 출력하시오.

In [44]:
frame.sort_values(by='c', ascending = True)

   a  b  c
1  9  7  3
0  4  4  5
2  2  3  7
3  5  2  9

In [45]:
frame.sort_values(by = 'c', ascending = False) #ascending 이용해서 내림차순 출력

   a  b  c
3  5  2  9
2  2  3  7
0  4  4  5
1  9  7  3

In [48]:
# 순위 매기기 rank
obj = Series([100, 23, 55, 44, 22, 99, 13])
obj.rank()
# 작은 값에 높은 순위를 준다
# index, 순위(0.0)

0    7.0
1    3.0
2    5.0
3    4.0
4    2.0
5    6.0
6    1.0
dtype: float64

In [13]:
# 내림차순으로 순위를 매긴다
obj.rank(ascending=False)

0    1.0
1    6.0
2    3.0
3    4.0
4    7.0
5    2.0
6    5.0
dtype: float64

In [14]:
obj = Series([100, 23, 100, 44, 22, 99, 33])
obj.rank()
# 동점이 있으면 평균값을 준다

0    6.5
1    2.0
2    6.5
3    4.0
4    1.0
5    5.0
6    3.0
dtype: float64

In [15]:
obj.rank(method='first')
# 동일한 값이 존재 할 경우 먼저 나타나는 것에게 높은 순위를 줄 수 있다

0    6.0
1    2.0
2    7.0
3    4.0
4    1.0
5    5.0
6    3.0
dtype: float64

In [57]:
frame = DataFrame({'b': [4,7,3,2], 'a': [4,9,2,5], 'c': [5,3,7,9]})
frame

   a  b  c
0  4  4  5
1  9  7  3
2  2  3  7
3  5  2  9

### 실습예제 4
frame에 rank를 적용해보시오.

In [58]:
frame.rank() #열 기준 rank수행

     a    b    c
0  2.0  3.0  2.0
1  4.0  4.0  1.0
2  1.0  2.0  3.0
3  3.0  1.0  4.0

In [59]:
frame.rank(axis=1) #행 기준으로 rank를 수행

     a    b    c
0  1.5  1.5  3.0
1  3.0  2.0  1.0
2  1.0  2.0  3.0
3  2.0  1.0  3.0

In [60]:
# 합을 구하면 기본적으로 열을 기준으로 구한다
frame.sum()

a    20
b    16
c    24
dtype: int64

In [61]:
# 행을 기준으로 구한다
frame.sum(axis=1)

0    13
1    19
2    12
3    16
dtype: int64

In [62]:
# NaN이 있으면
frame = DataFrame({'b': [4, 7, 3, 2], 'a': [4,9,2,5], 'c': [5,3,7,np.nan]})
frame

   a  b    c
0  4  4  5.0
1  9  7  3.0
2  2  3  7.0
3  5  2  NaN

In [63]:
frame.sum()

a    20.0
b    16.0
c    15.0
dtype: float64

In [64]:
frame.sum(skipna=False)
# NaN이 있으면 이를 반영한다 (스킵하지 않는다)
# skipna 은 skip NaN을 뜻함.

a    20.0
b    16.0
c     NaN
dtype: float64

### 실습예제 5
frame 합을 행을 기준으로 NaN이 있으면 이를 반영하지 않는 합을 구해보시오.

In [66]:
frame

   a  b    c
0  4  4  5.0
1  9  7  3.0
2  2  3  7.0
3  5  2  NaN

In [67]:
frame.sum(axis = 1)

0    13.0
1    19.0
2    12.0
3     7.0
dtype: float64

In [69]:
frame = DataFrame({'b': [4, 7, 3, 2], 'a': [4,9,2,5], 'c': [5,3,7,np.nan]})
frame

   a  b    c
0  4  4  5.0
1  9  7  3.0
2  2  3  7.0
3  5  2  NaN

In [24]:
# 최대치가 있는 위치를 반환한다
frame.idxmax()

a    1
b    1
c    2
dtype: int64

In [25]:
# 최소치가 있는 위치를 반환한다
frame.idxmin()

a    2
b    3
c    1
dtype: int64

In [26]:
# 기본 통계값을 보여준다
frame.describe()
# count = 갯수, mean = 평균, std = 표준편차 ,min = 최솟값, max = 최댓값

             a         b    c
count  4.00000  4.000000  3.0
mean   5.00000  4.000000  5.0
std    2.94392  2.160247  2.0
min    2.00000  2.000000  3.0
25%    3.50000  2.750000  4.0
50%    4.50000  3.500000  5.0
75%    6.00000  4.750000  6.0
max    9.00000  7.000000  7.0

In [91]:
# 항목 갯수 세기

# 유니크한 값 찾기 (set)
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [92]:
uniques = obj.unique() ## value 값의 종류를 확인 할 수 있다.
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [93]:
# 빈도수를 간단히 알 수 있다
# 빈도수가 높은 순으로 정렬된다.
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [94]:
# 빈도수와 관련없이 나타나는 순서대로 보려면
pd.value_counts(obj.values, sort=False)

b    2
d    1
c    3
a    3
dtype: int64

In [95]:
# 아래는 같은 결과를 얻는다
obj.value_counts(sort=False)

b    2
d    1
c    3
a    3
dtype: int64

In [32]:
# 특정한 내용이 들어있는지 알려면 isin()을 사용한다
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [33]:
obj## obj 값 확인

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [34]:
obj[mask] ## obj에서 mask 값이 true인 값만을 출력

0    c
5    b
6    b
7    c
8    c
dtype: object

In [35]:
# 아래는 같은 결과를 얻는다
obj[obj.isin(['b', 'c'])] ## isin는 is in을 뜻한다.

0    c
5    b
6    b
7    c
8    c
dtype: object

### 실습예제6
obj 에서 isin 문을 자유롭게 활용해보시오.

In [96]:
obj[obj.isin(['a'])]

1    a
3    a
4    a
dtype: object

In [36]:
# 데이터프레임에 대해서도 같은 작업을 할 수 있다
frame = DataFrame({'X':['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'], 
                  'Y':['f', 'g', 'd', 'g', 'h', 'e', 'd', 'h', 'f'],
                   'Z':['a', 'e', 'd', 'g', 'd', 'e', 'q', 'b', 'c']})

In [37]:
frame

   X  Y  Z
0  c  f  a
1  a  g  e
2  d  d  d
3  a  g  g
4  a  h  d
5  b  e  e
6  b  d  q
7  c  h  b
8  c  f  c

In [38]:
# 갯수를 센다. 없는 값은 NaN으로 표시된다
result = frame.apply(pd.value_counts)
result

     X    Y    Z
a  3.0  NaN  1.0
b  2.0  NaN  1.0
c  3.0  NaN  1.0
d  1.0  2.0  2.0
e  NaN  1.0  2.0
f  NaN  2.0  NaN
g  NaN  2.0  1.0
h  NaN  2.0  NaN
q  NaN  NaN  1.0

In [39]:
# 없는 값에 0을 대입한다
result = frame.apply(pd.value_counts).fillna(0) ## fillna 은 fii NaN을 뜻한다.
result

     X    Y    Z
a  3.0  0.0  1.0
b  2.0  0.0  1.0
c  3.0  0.0  1.0
d  1.0  2.0  2.0
e  0.0  1.0  2.0
f  0.0  2.0  0.0
g  0.0  2.0  1.0
h  0.0  2.0  0.0
q  0.0  0.0  1.0

In [97]:
# 결측치 처리 , 결측치 란? python NaN으로 값이 없다는 뜻이다.
from numpy import nan as NA ## numpy 안에서 nan을 Na으로 대체한다는 뜻입니다.
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [98]:
data.dropna() # drop na은 drop NaN을 뜻하여 data에서 Na값들이 떨어져 나간 것을 볼 수 있습니다.

0    1.0
2    3.5
4    7.0
dtype: float64

In [99]:
# 같은 결과
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [147]:
data = DataFrame([[NA, 6.5, 3.], [NA, NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
data

    0    1    2
0 NaN  6.5  3.0
1 NaN  NaN  NaN
2 NaN  NaN  NaN
3 NaN  6.5  3.0

In [148]:
data.dropna(thresh = 1)

    0    1    2
0 NaN  6.5  3.0
3 NaN  6.5  3.0

In [101]:
# 한 항목이라고 NA가 있으면 해당 행을 삭제한다
cleaned = data.dropna()
cleaned

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [102]:
# 행의 모든 항목이 NA일때 해당 행을 삭제한다
data.dropna(how='all')

    0    1    2
0 NaN  6.5  3.0
3 NaN  6.5  3.0

In [45]:
data

    0    1    2
0 NaN  6.5  3.0
1 NaN  NaN  NaN
2 NaN  NaN  NaN
3 NaN  6.5  3.0

In [46]:
# 컬럼에 대한 삭제시는 axis=1을 사용한다
clean2 = data.dropna(axis=1)
clean2

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [47]:
clean2 = data.dropna(axis=1, how='all')
clean2

     1    2
0  6.5  3.0
1  NaN  NaN
2  NaN  NaN
3  6.5  3.0

In [142]:
df = DataFrame(np.random.randn(7 , 3))

In [143]:
df.ix[:4, 1] = NA #(0,1) , (1,1) , (2,1) , (3,1) , (4,1) 값들이 Na로 대체된 걸 확인 할 수 있다.  
df.ix[:2, 2] = NA
df.ix[0,0] = NA
df

C:\Users\samsung\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

          0         1         2
0       NaN       NaN       NaN
1  0.707430       NaN       NaN
2 -0.886968       NaN       NaN
3 -0.932463       NaN -0.007516
4  0.312121       NaN  1.514006
5 -0.981896 -0.602417  0.383906
6 -2.153768 -0.041484 -0.489296

In [144]:
df.ix[:4, 1] = NA
df

          0         1         2
0       NaN       NaN       NaN
1  0.707430       NaN       NaN
2 -0.886968       NaN       NaN
3 -0.932463       NaN -0.007516
4  0.312121       NaN  1.514006
5 -0.981896 -0.602417  0.383906
6 -2.153768 -0.041484 -0.489296

### 실습예제7
위에서 np.random.randn(7,3)을 단독적으로 실행해보고 결과 값을 확인 해보시오.
활용 하여 np.random.randn 6 * 4 행렬을 만들고 DataFrame 형식으로 나타내보시오.

In [104]:
df = DataFrame(np.random.randn(7 , 3))
df

          0         1         2
0 -0.300176 -0.757435  0.152685
1 -0.024392 -0.021252 -1.243493
2  1.142529 -0.464548  1.000605
3  0.393803 -0.663951  0.099039
4  2.151872  1.950923  0.145071
5 -0.620581 -0.981105  1.164072
6 -1.576726  0.097754 -1.727705

In [120]:
df2 = DataFrame(np.random.randn(6, 4))
df2

          0         1         2         3
0 -0.656975  0.113231 -0.775180  0.403221
1 -1.499672  0.839997  0.828462 -0.277586
2  0.293481  1.222148  0.459807 -0.932302
3  1.449349 -0.626792 -0.545942 -0.208610
4 -1.106425  0.877945 -0.165853 -1.465524
5  0.691003 -2.777932 -0.867622 -0.604699

### 실습예제8
위 예제에서 만들었던 DataFrame에 (0,0) (1,1) (2,2) (3,3) 위치에 있는 값들을 Na 값으로 대체해보시오.

In [140]:
df2.ix[0, 0] = NA #(0,1) , (1,1) , (2,1) , (3,1) , (4,1) 값들이 Na로 대체된 걸 확인 할 수 있다.  
df2.ix[1,1]=NA
df2.ix[2,2]=NA
df2.ix[3,3]=NA
df2

          0         1         2         3
0       NaN  0.113231 -0.775180  0.403221
1 -1.499672       NaN  0.828462 -0.277586
2  0.293481  1.222148       NaN -0.932302
3  1.449349 -0.626792 -0.545942       NaN
4 -1.106425  0.877945 -0.165853 -1.465524
5  0.691003 -2.777932 -0.867622 -0.604699

In [145]:
df # df 확인

          0         1         2
0       NaN       NaN       NaN
1  0.707430       NaN       NaN
2 -0.886968       NaN       NaN
3 -0.932463       NaN -0.007516
4  0.312121       NaN  1.514006
5 -0.981896 -0.602417  0.383906
6 -2.153768 -0.041484 -0.489296

In [146]:
df.dropna(thresh=2) ## NaN 값이 2 이상인 헹을 제거한다.

          0         1         2
3 -0.932463       NaN -0.007516
4  0.312121       NaN  1.514006
5 -0.981896 -0.602417  0.383906
6 -2.153768 -0.041484 -0.489296

In [138]:
prat = DataFrame(np.random.randn(5,4))
prat.ix[:3,1]=None
prat.ix[:1,3]=None
prat

C:\Users\samsung\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix

          0         1         2         3
0 -0.038648       NaN  1.374219       NaN
1  0.398067       NaN -1.308251       NaN
2 -0.536508       NaN -0.168317 -0.455139
3  1.178563       NaN  1.478161  0.881756
4  0.193432  1.664811 -0.601322  0.464628

In [139]:
prat.dropna(thresh = 2)

          0         1         2         3
0 -0.038648       NaN  1.374219       NaN
1  0.398067       NaN -1.308251       NaN
2 -0.536508       NaN -0.168317 -0.455139
3  1.178563       NaN  1.478161  0.881756
4  0.193432  1.664811 -0.601322  0.464628

In [51]:
df.fillna(0) ## fillna 은 fill nan을 뜻합니다. nan이 0으로 대체된 것을 볼 수 있습니다.

          0         1         2
0  0.000000  0.000000  0.000000
1 -0.551445  0.000000  0.000000
2 -0.827230  0.000000  0.000000
3  2.939233  0.000000 -1.445335
4 -1.336096  0.000000 -2.308019
5 -0.696401 -1.338543  0.335230
6 -2.344175 -1.570471  1.619617

In [52]:
df ## 위와 같이 작업했으나 실제 df에는 영향을 주지 않습니다.

          0         1         2
0       NaN       NaN       NaN
1 -0.551445       NaN       NaN
2 -0.827230       NaN       NaN
3  2.939233       NaN -1.445335
4 -1.336096       NaN -2.308019
5 -0.696401 -1.338543  0.335230
6 -2.344175 -1.570471  1.619617

In [53]:
# 컬럼별로 다른 값을 채울 수 있다. 사전을 사용한다
# 사전이란? 아래의 {1: 0.5, 2 : -1} 형태의 자료구조입니다.
df.fillna({1: 0.5, 2: -1})

          0         1         2
0       NaN  0.500000 -1.000000
1 -0.551445  0.500000 -1.000000
2 -0.827230  0.500000 -1.000000
3  2.939233  0.500000 -1.445335
4 -1.336096  0.500000 -2.308019
5 -0.696401 -1.338543  0.335230
6 -2.344175 -1.570471  1.619617

In [54]:
df # fillna()로 내용은 바뀌지 않는다. 위도 마찬가지로 df에는 영향을 주지 않는 것을 볼 수 있습니다.

          0         1         2
0       NaN       NaN       NaN
1 -0.551445       NaN       NaN
2 -0.827230       NaN       NaN
3  2.939233       NaN -1.445335
4 -1.336096       NaN -2.308019
5 -0.696401 -1.338543  0.335230
6 -2.344175 -1.570471  1.619617

In [55]:
# 새로운 변수를 정의하면 바뀐 값을 얻는다
df2 = df.fillna({1: 0.5, 3: -1})
df2

          0         1         2
0       NaN  0.500000       NaN
1 -0.551445  0.500000       NaN
2 -0.827230  0.500000       NaN
3  2.939233  0.500000 -1.445335
4 -1.336096  0.500000 -2.308019
5 -0.696401 -1.338543  0.335230
6 -2.344175 -1.570471  1.619617

In [56]:
# fillna함수의 inplace 파라미터를 true로 정의하면 내부 변경이 가능하다.
df.fillna({1: 0.5, 3: -1}, inplace=True)

          0         1         2
0       NaN  0.500000       NaN
1 -0.551445  0.500000       NaN
2 -0.827230  0.500000       NaN
3  2.939233  0.500000 -1.445335
4 -1.336096  0.500000 -2.308019
5 -0.696401 -1.338543  0.335230
6 -2.344175 -1.570471  1.619617

In [57]:
# 바뀌어 있다
df

          0         1         2
0       NaN  0.500000       NaN
1 -0.551445  0.500000       NaN
2 -0.827230  0.500000       NaN
3  2.939233  0.500000 -1.445335
4 -1.336096  0.500000 -2.308019
5 -0.696401 -1.338543  0.335230
6 -2.344175 -1.570471  1.619617

### 실습예제9
np.random.randn을 활용해 3*3 Dataframe 구조를 만든 뒤 값들을 확인하여 음수에 해당하는 값들을 0으로 대체해보시오.

In [131]:
df3 = DataFrame(np.random.randn(3,3))
df3

          0         1         2
0  0.097009 -0.664238  0.682363
1  0.417720 -0.275361  1.824016
2 -0.407427 -1.068533  0.634001

In [134]:
df3.ix[0,1]=NA
df3
df3.fillna(0)

          0         1         2
0  0.097009  0.000000  0.682363
1  0.417720 -0.275361  1.824016
2 -0.407427 -1.068533  0.634001